artillery-test/upload-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 100
  processor: "./multipartUpload.js"  
  payload:
    path: "files.csv"
    fields:
      - username

scenarios:
  - name: Upload with manual multipart
    beforeRequest: "multipartUpload" 
    flow:
      - post:
          url: "/upload"
          headers:
            Content-Type: "multipart/form-data; boundary=--MyBoundary"  # dummy, sẽ bị override